# brew tap 'Homebrew/bundle'

tap 'Homebrew/bundle'
tap 'Homebrew/homebrew-dupes'
tap 'Homebrew/homebrew-versions'
tap 'Homebrew/homebrew-binary'
tap 'caskroom/homebrew-cask'
tap 'caskroom/homebrew-versions'
tap 'caskroom/homebrew-unofficial'
tap 'caskroom/homebrew-fonts'
tap 'caskroom/cask'

brew 'ag'
brew 'awscli'
brew 'cmake'
brew 'coreutils'
brew 'ctags'
brew 'curl'
brew 'direnv'
brew 'emacs', args: ['cocoa', 'japanese']
brew 'ffmpeg'
brew 'findutils'
brew 'git'
brew 'go'
brew 'graphviz'
brew 'icu4c'
brew 'imagemagick' # libtool, jpeg, libpng, freetype
brew 'jenkins'
brew 'kindlegen'
brew 'libxml2'
brew 'libyaml'
brew 'lv'
brew 'memcached'
brew 'mercurial'
brew 'mysql56'
brew 'openssl'
brew 'phantomjs'
brew 'postgresql'
brew 'qt5'
brew 'rar'
brew 'readline'
brew 'redis'
brew 'rsync'
brew 'sqlite'
brew 'terminal-notifier'
brew 'v8'
brew 'wget'
brew 'zsh'

# cask
cask 'alfred'
cask 'anvil'
cask 'appcleaner'
cask 'atom'
cask 'bartender'
cask 'bettertouchtool'
cask 'bathyscaphe'
cask 'blu-ray-player'
cask 'burn'
cask 'caffeine'
cask 'calibre'
cask 'carbon-copy-cloner'
cask 'ccleaner'
cask 'chicken'
cask 'cooviewer'
#cask 'coteditor'
cask 'dmm'
cask 'dockertoolbox'
cask 'duet'
cask 'dupscanub'
cask 'dropbox'
cask 'edgeview'
cask 'evernote'
cask 'firefox'
cask 'gitup'
cask 'google-chrome'
cask 'google-drive'
cask 'google-japanese-ime'
cask 'google-web-designer'
cask 'gyazo'
cask 'handbrake'
cask 'ifunbox'
cask 'iterm2'
cask 'java'
cask 'jdownloader'
cask 'kensington-trackball-works'
cask 'kindle'
cask 'league-of-legends'
cask 'libreoffice'
cask 'lighttable'
cask 'limechat'
cask 'lyrics-master'
cask 'macdown'
cask 'macid'
cask 'macvim-kaoriya'
cask 'mplayerx'
cask 'music-manager'
cask 'onyx'
cask 'opera'
cask 'paragon-ntfs'
cask 'parallels-desktop'
cask 'path-finder'
#cask 'plex-media-server'
cask 'sequel-pro'
#cask 'silverlight'
cask 'skype'
cask 'slack'
cask 'smoothmouse'
cask 'sourcetree'
cask 'spideroakone'
cask 'sublime-text3'
cask 'stackroom'
cask 'stay'
cask 'teamspeak-client'
cask 'teleport'
cask 'tuneinstructor'
cask 'unity'
#cask 'utorrent'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
cask 'xee'
cask 'xld'
cask 'xtrafinder'
#cask 'yorufukurou'
