# brew tap 'Homebrew/bundle'

tap 'Homebrew/bundle'
tap 'Homebrew/homebrew-dupes'
tap 'Homebrew/homebrew-versions'
tap 'Homebrew/homebrew-binary'
tap 'Homebrew/completions'
tap 'Homebrew/services'
tap 'caskroom/homebrew-cask'
tap 'caskroom/homebrew-versions'
tap 'caskroom/homebrew-fonts'
tap 'caskroom/cask'

brew 'ag'
brew 'awscli'
brew 'cask'
brew 'cmake'
brew 'coreutils'
brew 'ctags'
brew 'curl'
brew 'direnv'
brew 'docker-completion'
brew 'emacs', args: ['with-cocoa'], restart_service: :changed
brew 'ffmpeg'
brew 'findutils'
brew 'git'
brew 'go'
brew 'graphviz'
brew 'icu4c'
brew 'imagemagick'
brew 'jenkins', restart_service: :changed
brew 'kindlegen'
brew 'libffi' # ruby
brew 'libiconv' # nokogiri
#brew 'libxml2' # nokogiri
brew 'libyaml' #ruby
brew 'lv'
brew 'mas'
brew 'memcached', restart_service: :changed
brew 'mercurial'
brew 'mysql', restart_service: :changed
brew 'openssl' # ruby
brew 'phantomjs'
brew 'postgresql', restart_service: :changed
brew 'qt5'
brew 'rar'
brew 'readline' # ruby
brew 'redis', restart_service: :changed
brew 'rsync'
brew 'sqlite'
brew 'terraform'
brew 'terminal-notifier'
brew 'v8'
brew 'wget'
brew 'zsh'

# cask
cask 'alfred'
cask 'anvil'
cask 'appcleaner'
cask 'atom'
cask 'bartender'
cask 'bettertouchtool'
cask 'bathyscaphe'
cask 'blu-ray-player'
cask 'burn'
cask 'caffeine'
cask 'calibre'
cask 'carbon-copy-cloner'
cask 'ccleaner'
cask 'chicken'
cask 'cooviewer'
#cask 'coteditor'
#cask 'dmm'
cask 'dockertoolbox'
cask 'duet'
cask 'dupscanub'
cask 'dropbox'
cask 'edgeview'
#cask 'emacs'
cask 'evernote'
cask 'firefox'
#cask 'gitup'
cask 'google-chrome'
cask 'google-drive'
cask 'google-japanese-ime'
cask 'google-web-designer'
cask 'gyazo'
cask 'handbrake'
cask 'hyperswitch'
cask 'ifunbox'
cask 'iterm2'
cask 'java'
cask 'jdownloader'
#cask 'kensington-trackball-works'
cask 'kindle'
cask 'league-of-legends'
cask 'libreoffice'
cask 'lighttable'
cask 'limechat'
cask 'lyrics-master'
cask 'macdown'
cask 'macid'
cask 'macvim-kaoriya' # args: --override-system-vim
cask 'mplayerx'
cask 'music-manager'
cask 'onyx'
cask 'opera'
cask 'paragon-ntfs'
cask 'parallels-desktop'
cask 'path-finder'
#cask 'plex-media-server'
cask 'sequel-pro'
#cask 'silverlight'
cask 'skype'
cask 'slack'
cask 'smoothmouse'
cask 'sourcetree'
cask 'spideroakone'
cask 'sublime-text3'
cask 'stackroom'
cask 'stay'
cask 'steelseries-engine'
cask 'teamspeak-client'
cask 'teleport'
cask 'tuneinstructor'
cask 'unity'
#cask 'utorrent'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
cask 'xee'
cask 'xld'
#cask 'xtrafinder'
#cask 'yorufukurou'

mas 'CotEditor', id: 1024640650
mas 'Deckset', id: 847496013
mas 'Entropy', id: 437151949
mas 'Keynote', id: 409183694
mas 'PopClip', id: 445189367
mas 'Tweetbot', id: 557168941
#mas 'Dash2', id: 458034879

