# brew tap 'Homebrew/bundle'

tap 'homebrew/bundle'
tap 'homebrew/fuse'
tap 'homebrew/homebrew-dupes'
tap 'homebrew/homebrew-versions'
tap 'homebrew/homebrew-binary'
tap 'homebrew/completions'
tap 'homebrew/services'
tap 'caskroom/homebrew-cask'
tap 'caskroom/homebrew-versions'
tap 'caskroom/homebrew-fonts'
tap 'caskroom/cask'
tap 'codekitchen/dinghy'

brew 'ag'
brew 'awscli'
brew 'cask'
brew 'coreutils'
brew 'ctags'
brew 'curl'
brew 'dinghy'
brew 'direnv'
brew 'docker-completion'
#brew 'elasticsearch'
brew 'emacs', args: ['with-cocoa'], restart_service: :changed
brew 'ffmpeg'
brew 'findutils'
brew 'git'
brew 'go'
brew 'imagemagick'
brew 'jenkins', restart_service: :changed
brew 'kindlegen'
brew 'leiningen'
brew 'libffi' # ruby
#brew 'libiconv' # nokogiri
#brew 'libxml2' # nokogiri
brew 'libyaml' #ruby
brew 'lv'
brew 'mas'
brew 'memcached', restart_service: :changed
brew 'mercurial'
brew 'mysql', restart_service: :changed
brew 'openssl' # ruby
brew 'phantomjs'
brew 'postgresql', restart_service: :changed
brew 'python'
brew 'qt5'
brew 'rar'
brew 'readline' # ruby
brew 'redis', restart_service: :changed
brew 'rsync'
brew 'subversion'
brew 'sshfs'
brew 'sqlite'
brew 'terraform'
brew 'terminal-notifier'
brew 'v8'
brew 'xz', args: ['universal']
brew 'wget'
brew 'zsh'
brew 'zsh-completions'

# cask
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'anvil'
cask 'appcleaner'
cask 'atom'
cask 'bartender'
cask 'bettertouchtool'
cask 'bathyscaphe'
cask 'blu-ray-player'
cask 'burn'
cask 'caffeine'
cask 'calibre'
cask 'carbon-copy-cloner'
cask 'ccleaner'
cask 'chicken'
cask 'cooviewer'
#cask 'coteditor'
#cask 'dmm'
cask 'docker'
cask 'duet'
cask 'dupscanub'
cask 'dropbox'
cask 'edgeview'
#cask 'emacs'
cask 'evernote'
cask 'firefox'
#cask 'gitup'
cask 'google-chrome'
cask 'google-drive'
cask 'google-japanese-ime'
cask 'google-web-designer'
cask 'gyazo'
cask 'handbrake'
cask 'hyperswitch'
cask 'ifunbox'
cask 'iterm2'
cask 'java'
cask 'jdownloader'
#cask 'kensington-trackball-works'
cask 'kindle'
cask 'league-of-legends'
cask 'libreoffice'
cask 'lighttable'
cask 'limechat'
cask 'lyrics-master'
cask 'macdown'
cask 'macid'
cask 'macvim-kaoriya' # args: --override-system-vim
cask 'mplayerx'
cask 'music-manager'
cask 'onyx'
#cask 'opera'
cask 'paragon-ntfs'
cask 'parallels-desktop'
cask 'path-finder'
#cask 'plex-media-server'
cask 'scroll-reverser'
cask 'sequel-pro'
#cask 'silverlight'
cask 'sketch'
cask 'skype'
cask 'slack'
cask 'smoothmouse'
cask 'sourcetree'
cask 'spideroakone'
cask 'spotify'
cask 'sublime-text'
cask 'stackroom'
cask 'stay'
cask 'steelseries-engine'
cask 'teamspeak-client'
cask 'teleport'
cask 'tuneinstructor'
cask 'unity'
cask 'utorrent'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
cask 'xee'
cask 'xld'
#cask 'xtrafinder'
#cask 'yorufukurou'

mas 'BetterZip', id: 415086549
mas 'CotEditor', id: 1024640650
#mas 'Dash2', id: 458034879
mas 'Deckset', id: 847496013
mas 'Entropy', id: 437151949
mas 'Fotor Photo Editor', id: 503039729
mas 'Gemini', id: 463541543
mas 'Growl', id: 467939042
mas 'Keynote', id: 409183694
mas 'LINE', id: 539883307
mas 'Lyritop', id: 511004460
mas 'MenuMate', id: 518594271
mas 'Numbers', id: 409203825
mas 'PopClip', id: 445189367
mas 'Proxy', id: 874920950
mas 'Ringtones Phone', id: 583334712
mas 'Singlemizer', id: 410263119
mas 'The Duplicate Finder', id: 654667344
mas 'Tweetbot', id: 557168941
mas 'VOX', id: 461369673
mas 'Xcode', id: 497799835
#mas 'YoruFukurou', id: 428834068
mas 'iMovie', id: 408981434
mas 'iPhoto', id: 408981381
mas '紀伊國屋書店Kinoppy', id: 572547904
